Revit 2024 API
BuiltInFailures.CutFailures.CannotCutInstanceOut Property
 Can't cut instance of [Symbol] out of Wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCutInstanceOut { get; }
Visual Basic
Public Shared ReadOnly Property CannotCutInstanceOut As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCutInstanceOut {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CutFailures Class
Autodesk.Revit.DB Namespace